InformationRegisters/НастройкиШтатногоРасписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиШтатногоРасписания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьВилкуСтавокВШтатномРасписании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьИндексациюШтатногоРасписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьИсториюИзмененияШтатногоРасписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРазрядыКатегорииКлассыДолжностейИПрофессийВШтатномРасписании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьШтатноеРасписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользоватьВилкуСтавокВШтатномРасписании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользоватьИсториюИзмененияШтатногоРасписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользоватьШтатноеРасписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверятьНаСоответствиеШтатномуРасписаниюАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеТарифовИНадбавок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПредставлениеТарифовИНадбавок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьБронированиеПозиций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейСохраненияБрони</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/УправлениеШтатнымРасписаниемСобытия/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема «Учет штатного расписания».
//
// Методы, обслуживающие подписки на события.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет настройки учета среднего заработка в зависимости 
//  от количества в информационной базе специализированных начислений.
//
Процедура УстановитьИспользованиеИндексацииШтатногоРасписания(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Или Источник.Количество() = 0  Тогда
		Возврат;
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьИндексациюШтатногоРасписания") <> 
		Источник[0].ИспользоватьИндексациюЗаработка И ПолучитьФункциональнуюОпцию("ИспользоватьИсториюИзмененияШтатногоРасписания") Тогда
		НаборНастройкиШтатногоРасписания = РегистрыСведений.НастройкиШтатногоРасписания.СоздатьНаборЗаписей();
		НаборНастройкиШтатногоРасписания.Прочитать();
		НаборНастройкиШтатногоРасписания[0].ИспользоватьИндексациюШтатногоРасписания = Источник[0].ИспользоватьИндексациюЗаработка И ПолучитьФункциональнуюОпцию("ИспользоватьИсториюИзмененияШтатногоРасписания");
		НаборНастройкиШтатногоРасписания.ОбменДанными.Загрузка = Истина;
		НаборНастройкиШтатногоРасписания.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНовоеПодразделение(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	ЗаполнитьПодразделение(Источник);
	
КонецПроцедуры

Процедура ЗаполнитьНовоеПодразделениеПриКопированииПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	ЗаполнитьПодразделение(Источник);
	
КонецПроцедуры

Процедура ЗапомнитьДанныеПоУмолчаниюНовогоПодразделенияПриЗаписи(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ЗаписьНового") Тогда
		
		Если Источник.ДатаСоздания < ПодразделенияОрганизацийБЗККлиентСерверРасширенный.ДатаСозданияПоУмолчанию(ТекущаяДатаСеанса()) Тогда
			ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("СправочникПодразделенияОрганизаций", "ДатаРегистрацииДатыСоздания", ТекущаяДатаСеанса());
			ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("СправочникПодразделенияОрганизаций", "ДатаСоздания", Источник.ДатаСоздания);
		Иначе
			ОбщегоНазначения.ХранилищеОбщихНастроекУдалить("СправочникПодразделенияОрганизаций", "ДатаРегистрацииДатыСоздания", ИмяПользователя());
			ОбщегоНазначения.ХранилищеОбщихНастроекУдалить("СправочникПодразделенияОрганизаций", "ДатаСоздания", ИмяПользователя());
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПодразделение(Источник)
	
	Источник.Сформировано = Ложь;
	Источник.ДатаСоздания = '00010101';
	Источник.Расформировано = Ложь;
	Источник.ДатаРасформирования = '00010101';
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание") Тогда
		
		Если Не ПолучитьФункциональнуюОпцию("ИспользоватьИсториюИзмененияШтатногоРасписания") Тогда
			
			Источник.Сформировано = Истина;
			ДатаРегистрации = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("СправочникПодразделенияОрганизаций", "ДатаРегистрацииДатыСоздания", '00010101');
			Если ЗарплатаКадрыКлиентСервер.ДнейВПериоде(ДатаРегистрации, ТекущаяДатаСеанса()) < 7 Тогда
				Источник.ДатаСоздания = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("СправочникПодразделенияОрганизаций", "ДатаСоздания", '00010101');
			Иначе
				Источник.ДатаСоздания = ПодразделенияОрганизацийБЗККлиентСерверРасширенный.ДатаСозданияПоУмолчанию(ТекущаяДатаСеанса());
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
